<?php
$content = "----------------------------------------------------------------
详细信息:
错误时间:2016-12-08 16:24:00  站点:bjlt  委托网关地址:192.168.14.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.108.86:8002  的错误信息为:
-980023095[-980023095]客户密码错误,
错误时间:2016-12-08 16:24:00  站点:bjlt  委托网关地址:192.168.14.140:8080  请求类型:登录统计  券商ID:53  券商名:民族证券  营业部地址:118.186.132.75:8006  的错误信息为:
[120047][客户交易密码错误] [p_fund_account=9862049369],
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:331  券商名:国金证券  营业部地址:222.73.132.35:8008  的错误信息为:
资金帐号或密码错误！,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:331  券商名:国金证券  营业部地址:221.236.15.38:8002  的错误信息为:
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:90  券商名:银河证券  营业部地址:219.143.214.202:6012  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配。, -980023096[-980023096]客户密码错误或账号密码不匹配。,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.120.87:8002  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:331  券商名:国金证券  营业部地址:221.236.15.38:8002  的错误信息为:
资金帐号或密码错误！,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:90  券商名:银河证券  营业部地址:219.143.214.202:6012  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配。, -980023096[-980023096]客户密码错误或账号密码不匹配。,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.120.87:8002  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:331  券商名:国金证券  营业部地址:221.236.15.38:8002  的错误信息为:
资金帐号或密码错误！,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.139:8080  请求类型:登录统计  券商ID:90  券商名:银河证券  营业部地址:219.143.214.202:6012  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配。, -980023096[-980023096]客户密码错误或账号密码不匹配。,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.120.87:8002  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配,
111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111
2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333
111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111
2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222
3333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.120.87:8002  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配,
错误时间:2016-12-08 16:24:00  站点:whdx  委托网关地址:192.168.13.140:8080  请求类型:登录统计  券商ID:100  券商名:齐鲁证券  营业部地址:123.232.120.87:8002  的错误信息为:
-980023096[-980023096]客户密码错误或账号密码不匹配,
1111111111111111111111111111111111111111111111111111111111111111111111
1111111111111111111111111111111111111111111111111111111111111111111111
1111111111111111111111111111111111111111111111111111111111111111111111
1111111111111111111111111111111111111111111111111111111111111111111111
111111111111111111111111111111111111111112222223333333
111111111111111111111111111111111111111112222223333333
111111111111111111111111111111111111111112222223333333
111111111111111111111111111111111111111112222223333333

";
// $url = 'php7.host/getMail.php?' . $content;
$url = 'php7.host/getMail.php?aaa';

$ch = curl_init();
curl_setopt($ch, curlopt_url, $url);
// $ch = curl_init($url);
curl_setopt($ch, CURLOPT_HEADER, true);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLINFO_HEADER_OUT, true);
curl_setopt($ch, CURLOPT_HTTPHEADER, array('Expect:'));

// CURL_SETOPT($CH, CURLOPT_RETURNTRANSFER, 1);
// CURL_SETOPT($CH, CURLOPT_POST, 1);
// CURL_SETOPT($CH, CURLOPT_HEADER, 0);
// CURL_SETOPT($CH, CURLOPT_HTTPHEADER, ARRAY('EXPECT:'));

$response_header = curl_exec($ch);
$meta = curl_getinfo($ch);
var_dump($meta);
var_dump($response_header);



















// var_dump(file_get_contents('http://php7.host/getMail.php?aaa'));

// var_dump(file_get_contents('http://php7.host/getMail.php?ss' . $content));
// var_dump(get_headers('http://php7.host/getMail.php?' . $content));


// echo mb_strlen($content);
// $tmp = "aaa";
// $ch = curl_init();
// curl_setopt($ch, CURLOPT_URL, 'php7.host/getMail.php?' . urlencode($content));
// curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
// // curl_setopt($ch, CURLOPT_POST, 1);
// curl_setopt($ch, CURLOPT_HEADER, 0);
// curl_setopt($ch, CURLOPT_HTTPHEADER, array('Expect:'));

// var_dump(curl_exec($ch)); echo "++++";
// var_dump(curl_errno($ch)); echo "----";
// var_dump(curl_error($ch)); echo "0-00000000";
// curl_close($ch);

//返回报错：Illegal characters found in URL，没有发送请求包，没有urlencode
//返回报错：<html>
//<head><title>414 Request-URI Too Largetitle>head>
//<body bgcolor="white">
//<center><h1>414 Request-URI Too Largeh1>center>
//<hr><center>nginx/1.8.0center>
//body>
//html>
//
